<?php

use Illuminate\Database\Seeder;
use App\Settings;

class SettingsTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $data = [
        	[
        		'name' => 'brief_history',
        		'type' => 'text_area',
        		'ar_value' => 'برز نادي الرائد واشتهر في لعبة كرة القدم، حيث استطاع الصعود لمصاف فرق دوري الدرجة الأولى السعودي، وذلك موسم 1980-1981 مع نادي الروضة في التصفيات التي أقيمت في الرياض، ويهبط بعد موسم ويعود في موسم 1983-1984 للصعود مع نادي الأنصار. وفي موسم 1986 حقق الإنجاز الأغلى والأثمن بصعود الفريق الأول لمصاف أندية الدوري السعودي الممتاز كأول أندية منطقة القصيم يحقق هذا الإنجاز، ثم تكرر صعوده إلى الدوري الممتاز في نهاية أعوام 1989، 1992، 1998، 2002، 2007، ويتمتع الرائد بشعبية جماهيرية تعتبر الأولى بالقصيم والخامسة في المملكة العربية السعودية.',
        		'en_value' => 'برز نادي الرائد واشتهر في لعبة كرة القدم، حيث استطاع الصعود لمصاف فرق دوري الدرجة الأولى السعودي، وذلك موسم 1980-1981 مع نادي الروضة في التصفيات التي أقيمت في الرياض، ويهبط بعد موسم ويعود في موسم 1983-1984 للصعود مع نادي الأنصار. وفي موسم 1986 حقق الإنجاز الأغلى والأثمن بصعود الفريق الأول لمصاف أندية الدوري السعودي الممتاز كأول أندية منطقة القصيم يحقق هذا الإنجاز، ثم تكرر صعوده إلى الدوري الممتاز في نهاية أعوام 1989، 1992، 1998، 2002، 2007، ويتمتع الرائد بشعبية جماهيرية تعتبر الأولى بالقصيم والخامسة في المملكة العربية السعودية.',
        		'page' => 'about',
        		'slug' => 'brief_history',
        		'title' => 'Brief History'
        	], [
        		'name' => 'football',
        		'type' => 'text_area',
        		'ar_value' => 'برز نادي الرائد واشتهر في لعبة كرة القدم، حيث استطاع الصعود لمصاف فرق دوري الدرجة الأولى السعودي، وذلك موسم 1980-1981 مع نادي الروضة في التصفيات التي أقيمت في الرياض، ويهبط بعد موسم ويعود في موسم 1983-1984 للصعود مع نادي الأنصار. وفي موسم 1986 حقق الإنجاز الأغلى والأثمن بصعود الفريق الأول لمصاف أندية الدوري السعودي الممتاز كأول أندية منطقة القصيم يحقق هذا الإنجاز، ثم تكرر صعوده إلى الدوري الممتاز في نهاية أعوام 1989، 1992، 1998، 2002، 2007، ويتمتع الرائد بشعبية جماهيرية تعتبر الأولى بالقصيم والخامسة في المملكة العربية السعودية.',
        		'en_value' => 'برز نادي الرائد واشتهر في لعبة كرة القدم، حيث استطاع الصعود لمصاف فرق دوري الدرجة الأولى السعودي، وذلك موسم 1980-1981 مع نادي الروضة في التصفيات التي أقيمت في الرياض، ويهبط بعد موسم ويعود في موسم 1983-1984 للصعود مع نادي الأنصار. وفي موسم 1986 حقق الإنجاز الأغلى والأثمن بصعود الفريق الأول لمصاف أندية الدوري السعودي الممتاز كأول أندية منطقة القصيم يحقق هذا الإنجاز، ثم تكرر صعوده إلى الدوري الممتاز في نهاية أعوام 1989، 1992، 1998، 2002، 2007، ويتمتع الرائد بشعبية جماهيرية تعتبر الأولى بالقصيم والخامسة في المملكة العربية السعودية.',
        		'page' => 'about',
        		'slug' => 'football',
        		'title' => 'football'
        	],[
        		'name' => 'khadem_cup',
        		'type' => 'text_area',
        		'ar_value' => 'برز نادي الرائد واشتهر في لعبة كرة القدم، حيث استطاع الصعود لمصاف فرق دوري الدرجة الأولى السعودي، وذلك موسم 1980-1981 مع نادي الروضة في التصفيات التي أقيمت في الرياض، ويهبط بعد موسم ويعود في موسم 1983-1984 للصعود مع نادي الأنصار. وفي موسم 1986 حقق الإنجاز الأغلى والأثمن بصعود الفريق الأول لمصاف أندية الدوري السعودي الممتاز كأول أندية منطقة القصيم يحقق هذا الإنجاز، ثم تكرر صعوده إلى الدوري الممتاز في نهاية أعوام 1989، 1992، 1998، 2002، 2007، ويتمتع الرائد بشعبية جماهيرية تعتبر الأولى بالقصيم والخامسة في المملكة العربية السعودية.',
        		'en_value' => 'برز نادي الرائد واشتهر في لعبة كرة القدم، حيث استطاع الصعود لمصاف فرق دوري الدرجة الأولى السعودي، وذلك موسم 1980-1981 مع نادي الروضة في التصفيات التي أقيمت في الرياض، ويهبط بعد موسم ويعود في موسم 1983-1984 للصعود مع نادي الأنصار. وفي موسم 1986 حقق الإنجاز الأغلى والأثمن بصعود الفريق الأول لمصاف أندية الدوري السعودي الممتاز كأول أندية منطقة القصيم يحقق هذا الإنجاز، ثم تكرر صعوده إلى الدوري الممتاز في نهاية أعوام 1989، 1992، 1998، 2002، 2007، ويتمتع الرائد بشعبية جماهيرية تعتبر الأولى بالقصيم والخامسة في المملكة العربية السعودية.',
        		'page' => 'about',
        		'slug' => 'khadem_cup',
        		'title' => 'khadem_cup'
        	]
        ];

        foreach ($data as $setting) {
        	Settings::create($setting);	
        }
    }
}
